In [1]:
import pandas as pd

AttributeError: module 'pandas' has no attribute 'Seriec'

In [7]:
data = {
    'Yil':[2021,2020,2019,2017,2016,2015,2010],
    'Population':[33.9,33.5,32.9,31.9,31.4,40.9,28.5],
    'Temp':[1.54,1.48,1.62,1.65,1.66,1.64,1.53]
}

In [11]:
data1 = pd.DataFrame(data)

In [12]:
data1

    Yil  Population  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.62
3  2017        31.9  1.65
4  2016        31.4  1.66
5  2015        40.9  1.64
6  2010        28.5  1.53

NameError: name 'df' is not defined

In [23]:
datas =  {
    'Uzbekistan':{2021:33.9,2020:33.5,2019:32.5,2017:31.9},
    'Kazakhsatn':{2021:18.9,2020:18.5,2019:18.3,2017:18.1,2016:17.8},
}

In [24]:
df2 = pd.DataFrame(datas)

In [25]:
df2

      Uzbekistan  Kazakhsatn
2021        33.9        18.9
2020        33.5        18.5
2019        32.5        18.3
2017        31.9        18.1
2016         NaN        17.8

In [26]:
df2.index.name = "Yil"

In [27]:
df2

      Uzbekistan  Kazakhsatn
Yil
2021        33.9        18.9
2020        33.5        18.5
2019        32.5        18.3
2017        31.9        18.1
2016         NaN        17.8

In [28]:
df2 = pd.DataFrame(datas,index =[2021,2019,2017])

In [29]:
df2

      Uzbekistan  Kazakhsatn
2021        33.9        18.9
2019        32.5        18.3
2017        31.9        18.1

In [30]:
df2.T

            2021  2019  2017
Uzbekistan  33.9  32.5  31.9
Kazakhsatn  18.9  18.3  18.1

In [32]:
arr = df2.values

In [33]:
type(arr)

numpy.ndarray